# Initialize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentEntryPoint..::..Initialize Method
DocumentEntryPoint Class See Also
---
For Revit Macros internal use only.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Initialize(
	Object obj,
	string addinFolder
)
```

Visual Basic
---
```text
Public Sub Initialize ( _
	obj As Object, _
	addinFolder As String _
)
```

Visual C++
---
```text
public:
virtual void Initialize(
	Object^ obj,
	String^ addinFolder
) sealed
```

# ### Parameters
obj
    Type: System..::..Object
addinFolder
    Type: System..::..String
# ### Implements
IEntryPoint..::..Initialize(Object, String)
# See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace